package com.angcyo.sharebook.http.bean

/**
 * Created by angcyo on 2017-06-03.
 */

data class BookDetailBean(

        /**
         * isbn : 9787020102129
         * id : 26269501
         * title : 你配得起更好
         * subtitle : 世间最大的公平不过是：我们终将过上与自己的能力相匹配的生活
         * origin_title :
         * author : 晚睡
         * author_intro : 晚睡，作家。
         * 生命是一趟苦旅，但愿你能遇见晚睡。
         * 太多人因为欠缺一点勇敢和独立，才不得不迎接每天昏暗的晨光。殊不知，幸福始于对自我的精心照料。晚睡从不批判，也不指责，她只用文字教会你如何过忠于自己的生活。
         * 已出版作品《晚睡谈心》。
         * translator :
         * publisher : 人民文学出版社
         * pubdate : 2014-12-20
         * pages : 321
         * catalog : 目录
         * 序 黄佟佟：如果此生可以遇见晚睡

         * summary : 时间没有悲欢属性，总是一如既往地过去；幸福还是不幸，只取决于你自己。
         * 这本书中出现了太多急于走出失意却不得章法的面孔，晚睡一一告诉他们：别为了讨好而怠慢了自己，也别因为盲从而失了本心。
         * 做一个韧性的姑娘，不耽于意气，不荒于自怜。直面痛苦与疲乏，平息焦虑与恐惧。幸福，就在 对自己的精心耕种中渐渐清晰。
         * 唯有更好的自己，才能配得起更好的一切。
         * 当你变好，世界也会迎头赶上。
         * 阅后评测**********************************
         * 健康、通透、有力量，晚睡的爱情观也许不能确保你得到幸福，但是能帮助你爱得更有尊严。——刘瑜
         * 一想到在这糟糕的世界里还有晚睡，读她的文章、和她同行，心中就有踏实的暖意。世间有太多情感作家，但晚睡是唯一教会你自救的人。——黄佟佟
         * 晚睡语录**********************************
         * ♥时间对每一个人都是公平，你是一颗果子，或许会被时光酿成酒，你是一块顽石，或许会被时光打磨，想取得最好抑或最坏，这取决于你，时间只是一如既往的过去。
         * ♥自己情愿干的事情，多苦都不会是苦；自己不愿意干的事情，多容易都不会觉得轻松。人生很多苦，都是不自由之苦。有一种人的痛苦在于：命运给了他萝卜，可是他却偏偏喜欢白菜。
         * ♥你无法确定明天会有什么，你能够决定的，是当明天是一团未知的时候，你能不能笑得无忧无虑。
         * ♥哀怨的情绪就像最恶劣的传染源，会传播和感染到一个人的全部生活，叫人避之不及。于是相信自己不幸的人，果真会变得孤单。
         * ♥明天不见得更好——这是残酷的真理。但明天的好处就在于隐藏希望，或者会好呢，就这一个念头，就够我们支撑着走过糟糕的昨天。
         * ♥太懂女人心的男人，多半都有点危险。那些懂，哪里是与生俱来，不过都是在另外一些女人身上试刀而来。
         * ♥每一段存在十年以上的感情，都有自己的辛酸史，那些幸福美满的也不例外。伤害就像桌上的细尘，永远存在，我们只是用遗忘在上面书写看得见的幸福。
         * ♥我们爱着一切皆大欢喜的结局，不仅仅是因为爱着爱情，还因为我们都更爱胜利，惧怕失败。
         * ♥中年人最宝贵的品质之一是不刻薄，对所有的幼稚不刻薄，对所有的冲动不刻薄，对所有的年少不刻薄。
         * ♥知道自己犯了错的人，往往会表现得比别人更委屈，更愿意先发制人，以此压低犯罪感。小到小朋友吵架，大到感情出轨，莫不如此。
         * price : 32
         * tags : 励志,女性,情感,晚睡,成长,豆瓣文学,散文随笔,晚睡姐终于出书了
         * amount : 3
         * loan : 2
         * subscriber :
         * pic : mpic/1496394069.jpg
         */

        /**
         * {
        isbn: "9787040064773",
        id: "1562739",
        title: "大学英语自学教程（上册）",
        subtitle: "",
        origin_title: "",
        author: "高远",
        author_intro: "",
        translator: "",
        publisher: "高等教育",
        pubdate: "1998-11",
        pages: "",
        catalog: "",
        summary: "《大学英语自学教程(上册)》作为我国高等教育组成部分的自学考试，其职责就是在高等教育这个水平上倡导自学、鼓励自学、帮助自学、推动自学，为每一个自学者铺就成才之路。组织编写供读者学习的教材就是履行这个职责的重要环节。毫无疑问，这种教材应当适合自学，应当有利于学习者掌握、了解新知识、新信息，有利于学习者增强创新意识，培养实践能力，形成自学能力，也有利于学习者学以致用，解决实际工作中所遇到的问题。",
        price: "30.9",
        tags: "自考,英语,教材,自考教材,大学英语自学教程(上册),学习,实体书,用途：学习",
        amount: "4",
        loan: "0",
        subscriber: "",
        pic: "http://119.23.221.242/api/res/pic/mpic/1495804500.jpg",
        favorite: 0
        }*/

        var isbn: String = "",
        var id: String = "",
        var title: String = "",
        var subtitle: String = "",
        var origin_title: String = "",
        var author: String = "",
        var author_intro: String = "",
        var translator: String = "",
        var publisher: String = "",
        var pubdate: String = "",
        var pages: String = "",
        var catalog: String = "",
        var summary: String = "",
        var price: String = "",
        var tags: String = "",
        var amount: String = "",
        var loan: String = "",
        var subscriber: String = "",
        var pic: String = "",
        var favorite: Int = 0


        /**
         * {
        isbn: "9787040064773",
        title: "大学英语自学教程（上册）",
        author: "高远",
        author_intro: "",
        publisher: "高等教育",
        pubdate: "1998-11",
        pages: "",
        pic: "http://119.23.221.242/api/res/pic/mpic/1495804500.jpg"
        }
         * */
)
